[
  "mousewheel-image-zoom",
  "note-refactor-obsidian",
  "nldates-obsidian",
  "url-into-selection",
  "homepage",
  "calendar",
  "obsidian-rollover-daily-todos",
  "obsidian-tracker",
  "periodic-notes",
  "better-word-count",
  "copy-image",
  "refresh-preview",
  "image-to-text-ocr",
  "dataview"
]